<template>
    <div>
        <h1>このサイトについて</h1>
        <p>単語学習は英語学習において最も基本的な内容でありながら、真の意味で最も修得が困難な分野です。</p>
        <p>一体いくつの単語を覚えれば良いのでしょうか？ 一万語、あるいは二万語覚えたところで英単語には終わりがありません。英語学習において、英単語とは一生続けなければならないものなのです。</p>
        <p>このサイトが、英単語学習者にとっての復習用ツールとして役立つことを期待します。</p>
        <h1>特徴</h1>
        <h2>あなたの英単語力を表示します</h2>
        <p>現在いくつの単語を知っているか？ というのは単語学習における最重要の指標であると考えますが、従来の英単語学習アプリではこれを算出する機能が無いのが不満でした。</p>
        <p>Tangoにおいては単語帳に登録した英単語に基づき、あなたのおおよその英単語力を算出します。</p>
        <h2>単語の定義を英英で表示</h2>
        <p>外国語学習というものは一定のレベルを超えてからはその国の言語で学んだ方が理解が深まるようになります。</p>
        <p>そこでTangoにおいては単語の意味は原則として英英辞典の表記にしています。英英だと厳しい方のために英和機能も用意しています。</p>
        <h1>使用データベース</h1>
        <p>OpenSubtitleの頻度順データを元に英単語をレベル分けし、Wordnetを利用して辞書データベースを構築しています。いずれも無料データベースです。</p>
        <h1>単語レベルと収録語数</h1>
        <p>単語レベルは1～50まで存在します。語数との対応としてはだいたいレベル×1000語レベルという分け方になっています。</p>
        <p>WordNetの収録語数は約15万語ですので、おおよそ1/3の単語に対してレベルが与えられています。</p>
        <p>これは英検一級の認識語彙が一万～一万五千、ネイティブの認識語彙が三～四万語程度ということを考えると十分な数だと考えます。</p>
        <h1>単語のレベル分け</h1>
        <p>現状ではOpenSubtitle（映画字幕）の数十億語を頻度順に並べることによってレベル分けを行っています。</p>
        <p>しかし、これだけだとレベル分けとしては粗く、人名等の不適切な単語、不当に高いレベルや低いレベルの単語が含まれるという欠点があります。</p>
        <p>単語のレベル分けについては今後は他のソースも使用して精度を上げる予定です。</p>
    </div>
</template>
<script>
export default {

}

</script>
