<template>
    <div>
        <h1 class="title is-3">このサイトについて</h1>
        <p>単語学習は英語学習において最も基本的な内容でありながら、真の意味で最も修得が困難な分野です。</p>
        <p>一体いくつの単語を覚えれば良いのでしょうか？ 一万語、あるいは二万語覚えたところで英単語には終わりがありません。英語学習において、英単語学習とは一生続けなければならないものなのです。</p>
        <p>このサイトが、英語学習者にとっての復習用ツールとして役立つことを期待します。</p>
        <h2 class="subtitle is-4">あなたの英単語力を測定します</h2>
        <p>現在いくつの単語を知っているか？ というのは単語学習における最重要指標でありながら、従来の英単語学習アプリではこれを算出する機能を持ったものがありませんでした。</p>
        <p>Tangoにおいては単語帳に登録した英単語を基に、あなたのおおよその英単語力を算出します。</p>
        <h2 class="subtitle is-4">単語の定義を英英で表示</h2>
        <p>外国語学習というものは一定のレベルを超えてからはその国の言語で学んだ方が理解が深まるようになります。</p>
        <p>Tangoにおいては単語の意味は原則として英英表記にしていますが、英英だと厳しい方のために英和機能も用意しています。</p>
        <h2 class="subtitle is-4">使用データベース</h2>
        <p>フリーのコーパスである<a href="http://opus.nlpl.eu/index.php">OPUS</a>の<a href="http://opus.nlpl.eu/OpenSubtitles2018.php">OpenSubtitles</a>（映画字幕）の頻度順データを元に英単語をレベル分けし、フリーのデータベースである<a href="http://compling.hss.ntu.edu.sg/wnja/">日本語 Wordnet</a>を使用して辞書データベースを構築しています。</p>
        <h2 class="subtitle is-4">単語レベルと収録語数</h2>
        <p>単語レベルは1～50まで存在します。語数との対応としてはだいたいレベル×1000語レベルという分け方になっています。</p>
        <p>WordNetの収録語数は約15万語ですので、おおよそ1/3の単語（約5万語）に対してレベルが与えられています。</p>
        <p>これは英検一級の認識語彙が1万～1万5千、成人ネイティブの認識語彙が3万語程度(<a href="http://testyourvocab.com/blog/">Test Your Vocabularyの統計データより</a>)ということを考えると英語学習者にとっては十分な語数であると考えます。</p>
        <h2 class="subtitle is-4">単語のレベル分け</h2>
        <p>現状では<a href="http://opus.nlpl.eu/OpenSubtitles2018.php">OpenSubtitles2018</a>の全ての単語（約数十億語）を頻度順に抽出することによってレベル分けを行っています。</p>
        <p>これだけでもそれなりの精度を持ったレベル分けを行うことができますが、実用レベルとしてはやや粗く、人名等の不適切な単語、実際の難易度と乖離したレベルの単語が含まれるという欠点があります。</p>
        <p>これは元データが映画（会話文）のみをソースにしていることが原因です。今後単語のレベル分けについては他のソースも併用して精度を上げる予定です。</p>
    </div>
</template>
<script>
export default {

}

</script>
